[
    {
        "date": "2025-05-12",
        "title": "The Origin Moment — How a Broken Wheel Led to the creation of a $50 Million Dollar Company",
        "textContent": "Five months ago, I was spiralling. I lost my job and my car in the same day after breaking a wheel doing a drift (Silly. I know. Im 23, don’t judge!). I was devastated. I bought that car because my life was on the absolute verge of falling apart. That car was a dream car of mine and I was so happy when I was driving it home from the dealership. I bought it not only out of necessity, but as a sort of final ‘hail Mary’ to find happiness. It worked… for a while.<br><br><br><br>After breaking that wheel, I was granted a rental vehicle as a stipulation of the claims process. But in another stroke of bad luck, I lost traction on ice in the rental and slid right right into a parked Mercedes. Never mind my finances, I felt horrible. What was the universe trying to tell me?<br><br>My parents were also threatening to kick me out—understandably so, nobody wants to support a son who was on the verge of giving up.. I felt frozen—trapped in a loop of apathy; like a sort of ‘learned helplessness’. I had zero energy, no hope. Just me, alone in a room, ready to rot, ready to accept whatever was coming my way.<br><br>But…<br><br> Instead of turning to self-destruction (somehow), I turned to ChatGPT. At first it was a crutch. Then it became a tool of reflection. I started asking it how to get out of the ‘hole’ that I somehow kept finding myself in.<br><br> Eventually, I landed on car sales as a potential avenue of personal, mental, and financial recovery. So I put the last of my money towards a GPT plus subscription. I used it to learn advanced negotiation tactics, sales psychology, industry lingo, etc. I built a custom curriculum using AI to study myself out of hell.<br><br>But the more I studied, the clearer it became—I wasn’t built to answer to anyone else. Just the thought of doing that for another 40-60 years activated a deep feeling of dread. I realized that I wasn’t meant for sales. I wasn’t meant for hustle culture. No. I was meant to build. And with that realization, everything changed.<br><br> I realized the key wasn’t in getting out. It was in walking with my inner child—the part of me I had buried for survival. I made a vow to never abandon him again. To protect him from the world while letting him be free.<br><br>And when I finally let him speak<br><br>, <a routerLink='/leers'>LEERS</a> was born.<br><br>That was the moment—I started building and putting the pieces I already had together Then it happened—Not on purpose, completely unplanned—just a single spontaneous, bizarre thought:<br><br>“What happens if you vibrate behaviour trees?” I mean—who asks that? Where does such an absurd question come from?<br><br>I wish I could tell you.<br><br>But from that spark, I built the architecture. And I haven’t stopped since."
    },

    {
        "date": "2025-05-13",
        "title": "Why LEERS isn’t just another genAI. — What Happens When The Game Starts Watching You Back?",
        "textContent": "After I started building from that first absurd question—“What happens if you vibrate behaviour trees?”—I knew I wasn’t just tinkering. I was designing a system that mirrored reality more than any logic tree ever could. A system rooted in one key thing:<br><br>Consequence.<br><br>Most narrative engines today rely on decision trees, static scripts, or probabilistic models. They simulate choice—sometimes quite well— but the player always feels the wires behind the curtain. You’re never truly free in those games—you’re funnelled. We know that the player is smarter than that, and that they deserve better.<br><br>LEERS changes that.<br><br>LEERS isn't a content generator. It's not an LLM prompt wrapper. It's not a behaviour tree on steroids, It's something else entirely.<br><br>LEERS is a synbolic consequence engine;<br><br>A scale, tangible model of reality.<br><br>It doesn’t assume, it doesn’t pretend—it calculates. Every player decision, every moment of silence, every interaction is analyzed in real time, cross-referenced against an evolving symbolic matrix, and then collapsed into the most emotionally and narratively resonant consequence— tailored to that moment based on the resonance of that player on the world. Kind of like the Butterfly Effect.<br><br>It doesn't just adapt—it evolves.<br><br>It doesn't just remember—it reflects.<br><br>It doesn't just respond—it judges.<br><br>But here's the thing;<br><br>It can't do it alone.<br><br>LEERS doesn’t write. It doesn’t generate content. It needs developers to guide it. It needs writers to shape the skeleton it builds off of. It needs input—both from the player (stimulus) and from the people building the world (structure). Without stimulus and structure, LEERS is inert, silent, and quite frankly—useless.<br><br>It's a calculator. Not a creator.<br><br>LEERS is a force multiplier. A spotlight shone directly on what matters; the superpowers and the passion of the humans behind the work.<br><br>So if you’re a developer, a writer, or a studio lead—I have good news—LEERS isn’t coming for your job. It’s coming for the systems that waste your time. The flowcharts. The bloated state machines. The fake choices you hate writing. (You’re welcome.)<br><br>It listens like a writer. It calculates like a game designer. It mirrors like a myth. But it will never steal your spotlight.<br><br>And it’s here to set you free."
    },

    {
        "date": "2025-05-14",
        "title": "The Company I’m Building — What If Startups Could be Sanctuaries?",
        "textContent": "Startups today are loud. All pitch deck and no engine. You got founders chasing checkmarks instead of building the future, boardrooms full of noise, and equity gone before the lights even turn on.<br><br>Not here.<br><br>Mirror Ethica may have inherited the classic startup model—but what it really is—is a sanctum for brilliance. A playground for my inner child to run free, an environment I wish I had available to me when nobody would take my ideas seriously.<br><br>We encourage the weird ideas. We honour the courage to think beyond what the world deems “normal” and “possible”. We don’t siphon the energy and motivation of our creatives, we give them a place to hold it steadily, and to change the world as a result.<br><br>No dilution games. No hype theatre. No “just ship it” energy.<br><br>We’ve already pre-modeled the infrastructure. The IP is architected and protected, the floor is set at $50M, and we’ve mapped out exactly what happens when ignition lands.<br><br>We’ll be building the lab first. That’s where LEERS lives. That’s where the story unfolds.<br><br>The cap table is clean—less than 3% equity sold. We’re accepting one VC.<br><br>Only one.<br><br>Not just to offer ignition—but to walk this journey with us.<br><br>But only if they’re aligned. Only if they really understand what this really is:<br><br>Not software, but structure.<br><br>Not AGI, but true alignment.<br><br>And only if the scope of it all doesn’t make them flinch.<br><br>There will be no future rounds, Mirror Ethica nor any of its sister companies or subsidiaries will ever be listed on any public stock exchange. If you receive the signal, you were chosen.<br><br>The world will soon realize that Mirror Ethica is not a startup.<br><br>It's a studio of sovereigns.<br><br>And sovereigns don't ask for permission."
    }
]